app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "users_avatar", "users_birthdate", "users_description", "users_id", "users_lat", "users_links", "users_lon", "users_mail", "users_name", "users_origin", "users_pass") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "users_id" = ? WHERE "users"."id" = 3  [["updated_at", "2015-02-05 00:31:00.244647"], ["users_id", 1]]